gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/drivers/fsl_i3c.c
    (void)memset(&stateParams, 0, sizeof(stateParams));
    i3c_slave_handle_t *handle = (i3c_slave_handle_t *)intHandle;

    /* Check for a valid handle in case of a spurious interrupt. */
    if (NULL == handle)
    {
        return;
    }

    /* Get status flags. */
    if (false == I3C_SlaveTransferHandleGetStatusFlags(base, handle, &stateParams))
    {
        return;
    }

    /* Clear status flags. */
    I3C_SlaveClearStatusFlags(base, stateParams.flags);

    if (0UL != (stateParams.flags & (uint32_t)kI3C_SlaveBusStartFlag))
    {
        I3C_SlaveTransferHandleBusStart(base, &handle->transfer, &stateParams.pendingInts);
    }

    if (0UL != (stateParams.flags & (uint32_t)kI3C_SlaveEventSentFlag))
    {
        I3C_SlaveTransferHandleEventSent(base, handle, &handle->transfer);
    }

    if (0UL != (stateParams.flags & (uint32_t)kI3C_SlaveReceivedCCCFlag))
    {
        I3C_SlaveTransferHandleReceivedCCC(base, handle, &handle->transfer);
    }

    if (0UL != (stateParams.flags & (uint32_t)kI3C_SlaveMatchedFlag))
    {
        I3C_SlaveTransferHandleMatched(base, handle, &handle->transfer);
    }

    /* Get fifo counts and compute room in tx fifo. */
    I3C_SlaveGetFifoCounts(base, &stateParams.rxCount, &stateParams.txCount);
    stateParams.txCount = handle->txFifoSize - stateParams.txCount;

    /* Handle transmit and receive. */
    if ((0UL != (stateParams.flags & (uint32_t)kI3C_SlaveTxReadyFlag)) &&
        (0UL != (stateParams.pendingInts & (uint32_t)kI3C_SlaveTxReadyFlag)))
    {
        I3C_SlaveTransferHandleTxReady(base, handle, &stateParams);
    }

    if ((0UL != (stateParams.flags & (uint32_t)kI3C_SlaveRxReadyFlag)) &&
        (0UL != (stateParams.enabledInts & (uint32_t)kI3C_SlaveRxReadyFlag)))
    {
        I3C_SlaveTransferHandleRxReady(base, handle, &stateParams);
    }

    /* Handle stop event. */
    if (0UL != (stateParams.flags & (uint32_t)kI3C_SlaveBusStopFlag))
    {
        I3C_SlaveTransferHandleBusStop(base, handle, &stateParams);
    }
}

static void I3C_CommonIRQHandler(I3C_Type *base, uint32_t instance)
{
    /* Check for master IRQ. */
    if (((uint32_t)kI3C_MasterOn == (base->MCONFIG & I3C_MCONFIG_MSTENA_MASK)) && (NULL != s_i3cMasterIsr))
    {
        /* Master mode. */
        s_i3cMasterIsr(base, s_i3cMasterHandle[instance]);
    }

    /* Check for slave IRQ. */
    if ((I3C_SCONFIG_SLVENA_MASK == (base->SCONFIG & I3C_SCONFIG_SLVENA_MASK)) && (NULL != s_i3cSlaveIsr))
    {
        /* Slave mode. */
        s_i3cSlaveIsr(base, s_i3cSlaveHandle[instance]);
    }
    SDK_ISR_EXIT_BARRIER;
}

#if defined(I3C)
/* Implementation of I3C handler named in startup code. */
void I3C0_DriverIRQHandler(void);
void I3C0_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C, 0);
}
#endif

#if defined(I3C0)
/* Implementation of I3C0 handler named in startup code. */
void I3C0_DriverIRQHandler(void);
void I3C0_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C0, 0);
}
#endif

#if defined(I3C1)
/* Implementation of I3C1 handler named in startup code. */
void I3C1_DriverIRQHandler(void);
void I3C1_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C1, 1);
}
#endif

#if defined(I3C2)
/* Implementation of I3C2 handler named in startup code. */
void I3C2_DriverIRQHandler(void);
void I3C2_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C2, 2);
}
#endif

#if defined(I3C3)
/* Implementation of I3C3 handler named in startup code. */
void I3C3_DriverIRQHandler(void);
void I3C3_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C3, 3);
}
#endif
